{
  "status": "success",
  "totalResults": 74,
  "results": [
    {
      "title": "During Chicago’s auto racing heyday, a NASCAR race in Soldier Field ended in a razor-slim victory by Fireball Roberts",
      "link": "https://www.chicagotribune.com/history/ct-nascar-chicago-stock-car-racing-vintage-tribune-20230625-73tlrhp5d5h5pgul3zinqpjkiy-story.html#ed=rss_www.chicagotribune.com/arcio/rss/category/sports/",
      "keywords": null,
      "creator": ["Ron Grossman"],
      "video_url": null,
      "description": "The NASCAR drivers who will roar around downtown Chicago were preceded by stock car racers circling a Soldier Field track 67 years ago.",
      "content": "The NASCAR drivers who will shortly roar around Michigan Avenue and DuSable Lake Shore Drive in downtown Chicago were preceded by stock car racers circling a track inside Soldier Field 67 years ago. The 1956 Grand National 100-mile race, considered the first NASCAR cup series race held in Chicago, was witnessed by 14,402 fans who saw Fireball Roberts win by a car length over Jim Pascal, who was ahead until Roberts passed him on the 194th of 200 laps. Advertisement Stock car racing evokes images of county fairs and Southern racetracks, like the one in Roberts’ hometown that hosts the Daytona 500. But Chicago’s urbanites were passionate devotes of races at Soldier Field, which hosted a number of them during the mid-20th century. “The thing I’ll never forget is being in the front row on the wall,” Art Fehrman Jr., whose father drove in the race, told Autoweek many years later. “My hands were right on the wall, and I was looking down on the roofs of the cars as they whizzed by.” Advertisement The sport’s appeal was due to predictable crashes. Andy Granatelli, promoter of races at Soldier Field, was accused of scripting the violence, just as wrestling opponents are assumed to do. “Granatelli had five guys on his payroll whose job was to wreck you,” said Tom Pistone, a NASCAR alum who grew up in Chicago, said in the Autoweek article. “It was crazy racing, but it brought out the people.” Roy Hupp, 58, and Arthur Eiberg, 56, were injured when a stock car driven by Harry Bennett of Seattle crashed through steel gates during a race program at Soldier Field on July 26, 1950. Hupp and Eiberg were standing behind the gates. (Chicago Tribune archive) Whether the collisions were planned or accidental, stock car racing was dangerous. “In the 13th lap, the car driven by Les Olsen of Glenview was rolled over twice sideways and end over end three times before smashing into the south turn after being struck by a car driven by Roy Czach of Chicago,” the Tribune reported of a July 13, 1956, race in Soldier Field. In 1954, the Tribune’s “Wake of the News” column noted: “Mrs. Pistone is so upset by the spectacle of her husband screeching around the quarter mile, asphalt track that she no longer attends but sits at home in custody of the four young Pistones.” Overhearing the comments from Pistone, another driver responded. “Huh,” he snorted, “my old lady’s out for every race and gives me the devil ‘cause I never catch Pistone. Always keeps asking if I’m afraid to step on the gas.” Anthony “Andy” Granatelli, left, president of the Chicago Auto Racing Association, with a trophy to be presented to the winner of the Soldier Field stock car title on Sept. 5, 1954. Tom Pistone, center, was the 1953 winner and point standings leader at the time, and Skippy Michaels was the 1952 champ and a 1954 contender. (Chicago Tribune) Granatelli also offered Sunday races at the 87th Street Speedway, which operated for a handful of years at 1111 E. 87th St. in Chicago. The International Amphitheater on Halsted Street hosted a winter season for midget race cars, scaled-down versions of their big brothers, that competed in the Indianapolis 500. Stock car racing was a derivative of America’s love affair with the automobile. Chicago’s alleys were a proto-hot rodder’s proving grounds. Advertisement The fascination of Chicagoans dates to an era when there was no agreement about what to call a self-propelled vehicle. Eventually it would be known as just that, an automobile. In 1892, the first to appear on a Chicago street was ticketed as a “horseless carriage” by a police officer, who wrote the driver up for speeding. When the driver complained that he hadn’t exceeded 7 mph, the officer informed him the limit was 6. In 1895, the publisher of the Chicago Times-Herald offered $5,000 in prize money for a race from Jackson Park to Milwaukee and back by “self-propelling road carriages.” The event was inspired by the world’s first automobile race the previous year in France. Bad roads in Wisconsin led organizers to shorten the race to Evanston and back, a distance of about 54 miles. Run on Thanksgiving Day, the event gave Chicago bragging rights to America’s first automobile race. There was a heavy snowfall shortly before the race. One car cracked up, trying to get to the starting point via slippery streets. Only four of the six starters finished. Chicago's first auto race is about to start in Jackson Park on Thanksgiving in 1895. (Chicago Times-Herald) Considering the conditions, Frank Duryea’s winning time of 7 hours and 53 minutes wasn’t bad. In second place was a German-made car whose driver fainted from the cold along the route. A race official riding with him took over. The car crossed the finish line with the official steering with one hand while holding on to the driver with the other. The rules required a driver to stay with his car or be disqualified. The 1895 event having demonstrated street racing’s inescapable problems, the Chicago Cycle Racing Association went looking for a dedicated venue. The next year, it promoted automobile races at Tattersall’s, at Dearborn and 16th streets. The Chicago branch of a London horse auctioneer, the indoor hall’s income came from stabling thoroughbreds, and it was supplemented with the hosting of circuses, indoor football games, bicycle races and, finally, automobile races. Advertisement “No more than two vehicles will be permitted on the track at a time, as the speedway will not be wide enough for more,” the Tribune noted ahead of the race. Other venues’ proprietors recognized auto racing’s potential for profit. In short order, drivers and jockeys were alternatively speeding around Hawthorne Racetrack in southwest suburban Stickney. The Erie Railroad advertised special trains from Chicago to the auto races in Crown Point, Indiana. Chicago drivers Len Morrison, left, and Tony Calvo fight it out in the south turn at Soldier Field in the professional sports car races, circa 1958. (Chicago Tribune archive) The County Fair in northwest suburban Palatine touted its seven auto races as “The Greatest Racing Event in Cook County.” Auto racing was warmly welcomed at Soldier Field, which opened in 1924. The neoclassical amphitheater was something of a white elephant. It mimicked a stadium the Romans might have used for chariot racing or Olympic events. American team sports could only awkwardly be accommodated. Soldier Field’s management was happy to add automobile races to the regular and greatly varied fare of pageants and performers. Its first event featured a chariot race and motorcycle polo. Al Jolson, star of the first sound movie, and W.C. Handy, father of the blues, sang there. The annual Chicago Tribune Music Festival featured hundreds of musicians. Midget auto races on a wooden track with banked curves began in 1935 in Chicago’s lakefront stadium. The wood was replaced by dirt and then an asphalt track. Stock cars joined the midget racers, the common denomination being the excitement fans got for a $2.50 ticket, which was guaranteed by Soldier Field’s architecture. Advertisement The opening events of the board track midget auto race were held on June 18, 1939, in Soldier Field. The track, the largest board oval ever built at the time, was 28 feet wide, with a 6-foot infield apron. The banks sloped at 30 degrees. Engineers estimated drivers to do 100 mph on the oval track. (Chicago Tribune historical photo) “The big, thick concrete wall — it was 8 or 9 feet tall got big and came at you in a hurry,” said John Carollo, who raced there. “You wondered if you were going to make it or eat the guardrail on the inside.” Vintage Chicago Tribune Weekly The Vintage Tribune newsletter is a deep dive into the Chicago Tribune's archives featuring photos and stories about the people, places and events that shape the city's past, present and future. By submitting your email to receive this newsletter, you agree to our Subscriber Terms & Conditions and Privacy Policy . > Demolition derbies stripped the sport down to essentials. The object was to bang into other cars until they weren’t drivable. The last car running won. Granatelli’s promotions would draw 40,000 spectators. Yet racing in Soldier Field ended in 1968. Some pit-stop mavens think they were done in by neighbors’ objections to the noise and exhaust fumes. Others charge it was up to the vagaries of Chicagoans’ entertainment preferences. Whatever the case, NASCAR drivers on July 2 will roar past the north end of a silent Soldier Field. Yet that could change, should the Chicago Bears make good on their off-again, on-again threat to ditch Soldier Field. That would knock a hole the size of a souped-up bulldozer in the budget of its owner, the Chicago Park District. Perhaps renewed stock car racing could take up the slack. The blueprint could be drawn from Granatelli’s ads, which guaranteed: “DANGER! THRILLS CHILLS SPILLS.” Thanks to Rich Van Durme of Chicago for suggesting this story. Advertisement Have an idea for Vintage Chicago Tribune? Share it with Ron Grossman and Marianne Mather at rgrossman@chicagotribune.com and mmather@chicagotribune.com .",
      "pubDate": "2023-06-25 10:00:00",
      "image_url": "https://www.chicagotribune.com/resizer/svfTOyQO6scYgRCsa-CKTu-WjE0=/cloudfront-us-east-1.images.arcpublishing.com/tronc/N3C4SKW5AJAZDAVKAYC4ATH2SM.jpg",
      "source_id": "chicagotribune",
      "category": ["sports"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Rod Stewart raging and 'stormed off stage' after gig cut short",
      "link": "https://www.dailyrecord.co.uk/news/scottish-news/rod-stewart-stormed-off-stage-30316682",
      "keywords": ["Entertainment"],
      "creator": ["reporters@dailyrecord.co.uk (Rory Cassidy, Kate Wilson)"],
      "video_url": null,
      "description": "The 78-year-old was playing in Plymouth last night when the lights were turned off before his last song.",
      "content": "Rod Stewart. (Image: Getty Images) × Group 28 Get the latest entertainment news sent straight to your inbox with our weekly Showbiz newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice Rod Stewart fans were left fuming after the singer 'stormed off stage' during a gig. The 78-year-old was playing in Plymouth last night ahead of a series of summer shows across the UK. But the music legend's set at Home Park stadium appeared to be cut short when the stage turned to darkness at 10.30pm. It is said to be down to a strict curfew at the venue, but shocked fans were quick to complain. As reported by our sister title, The Mirror , one fan said: “After attending the Rod Stewart concert yesterday evening, he finished his second to last song – the finale being We Are Sailing – to be told it was 10.30pm and he couldn’t continue. “With this Rod stormed off the stage and the concert was left without light, only to be told the Lord Mayor had put a stop to it. Hundreds of fans like myself were left in shock.” Rod Stewart performs at the Mission Estate Winery on April 08, 2023 in Napier, New Zealand. Read More Related Articles Concern grows for man missing from Scots town since Saturday afternoon Read More Related Articles Scot shocked at losing disabled parking space after returning from extended hospital stay Another said: “It was a fabulous night, but what an abrupt end. A guy dressed in black came onto the stage and ordered Rod off because of a curfew. \"Rod, of course, immediately left and the lights came on. No goodbye to fans, no encore. Everyone was stunned at the rude and abrupt ending to what was an amazing concert. \"Who was the guy in black who asked Rod to leave the stage? Why did Rod end the concert so abruptly? We were at the front and poor Rod looked stunned. \"For an artist to have his performance cut short so rudely and abruptly at the finale is awful. We came out saying that he was amazing but we would never attend a concert at Home Park again because performers are dragged off stage because of a curfew. Read More Related Articles Souness charity swim smashes target as donations continue to flood in a week on Read More Related Articles Mothership returns to shore after dropping doomed Scots student at Titanic wreckage \"Another few minutes to finish and say goodbye is all it would have taken. He had not even reached the end of the song before he was asked to leave the stage. They should have started earlier if they had such a strict policy.\" Others took to social media to vent their anger. One fan said said on Facebook: \"At 10.29pm he [Rod] is called to the side of the stage, was told 'the mayor says you have gone over your curfew. \"Rod shouts, 'tell the mayor to f*** off!', and then boom, stage in darkness and that's that. Everyone was waiting for an encore but spotlights came on and cleaners start moving in. \"So no We Are Sailing which would have been the encore. For Plymouth that was a must, a Naval town that was home to The Ark Royal that is so poignant to anyone here with that connection.” Read More Related Articles Retired Scots golfer says Prince Andrew 'insulted Scotland' after defying robes rules Read More Related Articles Guns N' Roses fans all have the same complaint after Glastonbury headline slot On Twitter, one fan wrote: “What an utter t*** to have @PlymLordMayor and @plymouthcc to abruptly end @rodstewart concert at @homeparkstadium last night just because of a curfew is totally rude and disrespectful. “I sincerely hope Sir Rod takes this further and those responsible are dealt with accordingly!” Another wrote: “This will make other big name bands think twice about coming to Plymouth. What an utter embarrassment.” Others pointed out they had been to gigs at the same Plymouth venue where the acts hadn’t been taken off stage early. One said: “Interesting as the Muse gig finished at 10.40pm at the same venue\". Not everyone was as sympathetic and blasted Da Ya Think I’m Sexy singer Rod for \"poor time management\". One person said: “Rod Stewart would have known the curfew times and he would have known his set time. “He would have chosen the songs he was going to perform and how much time he would have needed between songs to chat to the crowd. Seems to me this is down to poor time management.” Neither Rod nor the venue have commented publicly. Don't miss the latest news from around Scotland and beyond - Sign up to our daily newsletter here . READ NEXT: Brothers guilty of torching their struggling shop after CCTV caught one buying petrol Scots mum opens up on horror of losing fingers in 'horrendous' machete attack at her home Partygate video unearthed as Tories drink, dance and mock Covid rules at bash Top news stories today Widow claims NHS bosses spied on husband SNP quizzed over foreign donation Alleged teen rapist avoids justice Gang harass couple over son's £80k debt Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Facebook Social media Rod Stewart",
      "pubDate": "2023-06-25 09:13:19",
      "image_url": "https://i2-prod.dailyrecord.co.uk/incoming/article30177038.ece/ALTERNATES/s615/1_JS296171962.jpg",
      "source_id": "dailyrecord",
      "category": ["entertainment"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "Bayern Munich set to HIJACK Man Utd's Mason Mount bid as Thomas Tuchel approves transfer",
      "link": "https://www.mirror.co.uk/sport/football/news/mason-mount-man-united-transfer-30316461",
      "keywords": ["Football"],
      "creator": ["mirrornews@mirror.co.uk (Fraser Watson)"],
      "video_url": null,
      "description": "Manchester United's hopes of securing a deal for Mason Mount appear to be fading after having three separate bids for the England midfielder rejected by Chelsea",
      "content": "Bayern Munich are planning a sensational swoop for Mason Mount with Manchester United struggling to finalise a deal for the Chelsea star. Erik ten Hag has made the England international a priority signing this summer, but has thus far had three bids rejected. The London club have offered a compromise, asking their rivals to bid £58 million with the potential for £7 million more in add ons, a notion which United have seemingly baulked at. The stalemate has reportedly forced Ten Hag to focus on other targets. And the Dutch boss is now being linked with moves for Brighton's Moises Caicedo and Bayern Munich's Ryan Gravenberch. Mount's contract expires in 2024 and he's already outlined that he won't be extending his current deal. His stance means it benefits Todd Boehly to sell him this summer, rather than let the academy graduate leave for free in 12 months' time. Transfer news LIVE: Man Utd decide on De Gea, Arsenal after Timber, Chelsea line up La Liga star Man Utd give up on Mason Mount for alternative transfer target after third bid rejected And in a dramatic development, the Bundesliga giants could now be Mount's next destination. Bayern manager Thomas Tuchel wants his club to capitalise on Manchester United’s struggle to agree a fee, and according to The Guardian , the German giants are preparing to hijack their negotiations at the 11th hour. Mount, 24, was an integral part of the Chelsea side that won the Champions League under Tuchel in 2020/21, and remains highly rated by his former boss. Indeed, it was after his departure from Stamford Bridge that his career seemingly derailed, failing to hold down a regular place under Graham Potter or Frank Lampard . Bayern's hopes could inevitably rest on whether Mount has any desire to leave England. Despite going to the World Cup in Qatar , his lack of first-team action has cost him on the international stage, as he was left out of Gareth Southgate's squad for the recent games against Malta and North Macedonia. Tuchel is a big admirer of Mount's talents after working with him at Chelsea ( Image: ADRIAN DENNIS/Getty Images) HAVE YOUR SAY! What is Mason Mount worth ? Comment below . Bayern are showing ambition in the transfer market this summer after an indifferent 2022/23 campaign. Despite retaining their top flight title , albeit amid a collapse from Borussia Dortmund on the final day, they were dumped out of the Champions League by Manchester City and CEO Oliver Kahn was sacked immediately after the campaign. The club have been in the race to sign Declan Rice from West Ham . However, the £100million price tag, coupled with Rice's desire to remain in the Premier League , has scuppered their hopes. Mateo Kovacic was also another target. The ex-Chelsea man, who also played under Tuchel, is instead set to join treble winners City.",
      "pubDate": "2023-06-25 08:51:23",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30316578.ece/ALTERNATES/s615/0_Bayern-Munich-set-to-HIJACK-Man-Utds-Mason-Mount-bid-as-Thomas-Tuchel-approves-transfer.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "'If Declan Rice wants to win trophies then picking Man City over Arsenal is a no-brainer!'",
      "link": "https://www.mirror.co.uk/sport/football/news/if-declan-rice-wants-win-30313209",
      "keywords": ["Football"],
      "creator": ["mirrornews@mirror.co.uk (Robbie Fowler)"],
      "video_url": null,
      "description": "ROBBIE FOWLER COLUMN: Apologies to any Arsenal fans who think that Declan Rice can realise his full potential across the capital. The reality is that the Gunners are a work in progress",
      "content": "If Declan Rice wants to win trophies then he must sign for Manchester City. Apologies to any Arsenal fans who think that the West Ham midfielder can realise his full potential by moving across the capital. The reality is that the Gunners are a work in progress who punched above their weight last season - and still finished second to City. The one thing a player is guaranteed when they sign up for Pep Guardiola at the Etihad is a bag full of medals. Just ask the last midfielder who cost City £100 million. Since leaving Aston Villa two years ago, Jack Grealish has won the Champions League, two Premier League titles and the FA Cup. No wonder Jack felt like celebrating after City clinched the Treble! My former club are serial winners. Apparently, City are ready to gazump the Gunners in the bidding for Rice - and you can be sure West Ham chairman David Sullivan will squeeze every penny out of the deal. Pep Guardiola plots next marquee transfer after Declan Rice with Kyle Walker replacement Jurrien Timber claims he has transfer agreement to join Arsenal after snubbing Man Utd But ultimately, the decision will be down to Rice. He can leave the Hammers with his head held high after captaining them to the Europa Conference League earlier this month. And the money his departure will generate can help David Moyes build on that success. Rice is a London boy - and Arsenal will hope home comforts might convince him to turn down a move to the north west. But the world is a small place. Rice could fly from Manchester to London in about the same time it would take him to drive from Rush Green to London Colney. It has been suggested that Mikel Arteta will offer Rice the chance to become Arsenal captain to sweeten a deal. And his namesake Pat Rice wasn’t a bad Gunners skipper was he? Declan will retire as a wealthy man whether he signs for City, Arsenal or stays at the Olympic Stadium. And, anyway, he doesn’t strike me as someone who is motivated by money. Rice’s decision will be made on what is best for his career. And, in my opinion, that means signing on the dotted line for City. Declan Rice is wanted by both Arsenal and Man City After failing to win anything in his first season, Guardiola has taken 14 trophies back to the Etihad in six years, if you include a couple of Community Shield triumphs. That’s quite a strike rate. You can be sure that Kyle Walker, John Stones and Phil Foden would have been in Rice’s ear during their time with England. But perhaps the one City player he might want to take advice from is Kalvin Phillips. Phillips’ first season with the Blues has been a real test of his character. After making the £42 million move from Leeds, the Yorkshireman would have backed himself to make more of an impact. Yes, he suffered with injury problems, but just four starts in all competitions isn’t what he would have expected after being recruited to replace Fernandinho. Rodri has become one of Guardiola’s most trusted players - and cemented his growing stature with the winning goal against Inter Milan in the Champions League final. Arsenal legend questions Declan Rice transfer pursuit as Man City enter race How Arsenal could line up with four new signings from £200m spree and two major exits The Spaniard played in 56 of City’s 61 games last season - more than any other player. Even for a coach like Guardiola who trusts his squad, Rodri has become indispensable. And the City boss has even turned Stones into a centre-back capable of stepping effortlessly into central midfield in the blink of an eye. Losing Ilkay Gundogan to Barcelona is a big blow, while there are suggestions that Bernardo Silva could also leave this summer. But City have reacted by signing Mateo Kovacic from Chelsea for £25 million. So the question Rice must ask is whether he backs himself to break into a team where reputations and price tags count for absolutely nothing? Arsenal are a huge club with a storied history. But City are writing their own history at the moment. Trent doesn't need to reinvent the wheel! If Trent Alexander-Arnold was put on the transfer list by Liverpool tomorrow, every top club in Europe would want to sign him. Pep Guardiola would love him at Manchester City. Real Madrid, Barcelona, Paris St Germain and Bayern Munich exactly the same. That’s why I don’t buy into this theory that Trent has to reinvent himself if he is going to break into Gareth Southgate’s team. He excelled in midfield as England wiped the floor with Malta and North Macedonia in their two Euro qualifiers last week. Trent Alexander-Arnold has recently been handed some opportunities with England ( Image: PA) And the big question now being asked by the pundits is whether he can do the business against some world-class opposition. But Alexander-Arnold is one of England’s best 11 footballers - whether he is operating as a full-back or a midfielder. He should be one of the first names on Southgate’s team sheet. The quality he provides on the ball more than outweighs the defensive deficiencies that have been used as a big stick to beat him with. There is a tendency in football to look for negatives. But the bottom line is that Alexander-Arnold gives England a creativity that they would otherwise be lacking. The quality and range of his passing is up there with Kevin De Bruyne. When it comes to set-pieces, he is the best England have produced since David Beckham. Yes, Trent Alexander-Arnold is that good. Jurgen Klopp asked him to push into midfield as an inverted right-back during the final weeks of the season - and was rewarded with some stellar performances. I would like to see Southgate be brave and give him the same kind of role, rather than simply using him as an orthodox midfielder. Arsenal step up summer transfer plan as they launch second bid for fourth target Brazil U20 World Cup star Marcos Leonardo primed for big European transfer It’s a travesty that at the age of 24, a player who has been instrumental in helping Liverpool win every trophy possible has just 20 caps for his country. I am always being asked about my time with England - and my answer always captures how disappointed I am that I didn’t enjoy it more. It isn’t just the fact that I know a player of my talent should have played more than 26 internationals. It is about the reality that I never felt like I was part of the squad. It was like I was there to make up the numbers. Alexander-Arnold has made it clear that he is desperate to play for England. He missed the last Euros through injury and was then left out of the squad for the World Cup in Qatar. That kind of disappointment can damage players. It was great to hear Trent say after his goalscoring performance against Malta that he wants to give Southgate “a headache.” Hopefully, he’s done exactly that.",
      "pubDate": "2023-06-25 07:00:00",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30312188.ece/ALTERNATES/s615/0_West-Ham-Untied-Pitch-Inspection-UEFA-Conference-League-Final-Prague-Czech-Republic-06-Jun-20.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "Man Utd XI from David de Gea's debut including Wayne Rooney and Jose Mourinho favourite",
      "link": "https://www.mirror.co.uk/sport/football/news/manutd-transfer-degea-rooney-mourinho-30313788",
      "keywords": ["Football"],
      "creator": ["mirrornews@mirror.co.uk (Daniel Orme)"],
      "video_url": null,
      "description": "David de Gea could be set to bring to an end a hugely successful 12-year-spell with Manchester United this summer and would be the final player to leave the club from his debut",
      "content": "David de Gea looks set to bring a curtain down on a long and successful career as a Manchester United player. Signed from Atletico Madrid in 2011 under the stewardship of Sir Alex Ferguson, he is assured of a legendary place in the club’s history. De Gea has lifted the Premier League, FA Cup, two League Cups and the Europa League during his time at Old Trafford. Plenty has changed at the club during the Spaniard’s time, none least the starting XI that he played with on his Premier League debut. De Gea’s first top-flight outing came in a 2-1 win over West Brom in August 2011. Take a look at the side that the Red Devils fielded that day and what has happened since: Man Utd takeover LIVE: Sheikh Jassim plans sackings, Glazer delay explained, Mount and Onana bids 'lodged' Erik ten Hag hands Man Utd four-man transfer shortlist as Mason Mount bids fail David de Gea Interestingly, the Spanish stopper is the only player from De Gea's debut left at the club. Following his debut for the side, he endured a tough start to life at Old Trafford. He overcame any doubt over his suitability for the Red Devils and has gone on to accumulate 545 appearances for the club. As it stands, he will leave the club on a free transfer after failing to agree terms on a new contract. David de Gea at Manchester United in 2011 Should Man Utd keep David de Gea? Share your thoughts in the comments below Ashley Young Whilst De Gea could be on the move this summer, the same can be said of former winger Ashley Young. His debut coincided with De Gea’s and he went on to have a nine-year stint at Old Trafford before he moved. A move to Italian giants Inter Milan was then next on the agenda and he helped the club to end their long wait for a Serie A crown. Young, a 39-time England international, then made an emotional return to Aston Villa and has only just left this summer at the end of his deal. Rio Ferdinand Twice the most expensive defender in world football, Ferdinand proved to be one of Ferguson’s best acquisitions of all time. The former Leeds and West Ham man-made 455 appearances as a Red Devil, winning six Premier League titles, the Champions League and a whole host of other trophies. He brought the curtain down on his Old Trafford career at the end of the 2013/14 campaign with a move to Queens Park Rangers. The switch did not go as intended as Ferdinand made just 12 appearances before deciding to retire. He has now launched a successful punditry career. Andre Onana switches agent as Man Utd transfer gathers pace after talks Erik ten Hag transfer plan accelerates as deal given green light by Arsenal Chris Smalling Arriving at Old Trafford in a bargain move from Fulham, Smalling is potentially one of the more under-appreciated names in United’s recent history. The central defender made 323 appearances for the club and won a host of trophies until he was eventually allowed to depart in 2019 for a loan spell with Roma. He has since gone on to become a key performer for the Italian giants and under Jose Mourinho. Smalling has continued to lift silverware at the Stadio Olimpico and claimed the Europa Conference League title in 2022. Nemanja Vidic Intriguingly, Vidic ended up making fewer appearances for the Red Devils than Smalling but his impact was certainly not lessened. After arriving from Spartak Moscow, he became one of the most imperious defenders in Premier League history. He played a role in five Premier League title successes, the Champions League win in 2008 and much more. Vidic rounded off his career with a one-year spell in Italy with Inter Milan but was unable to claim a trophy in the final season of his career. Rio Ferdinand and Nemanja Vidic won plenty of silverware together at Man United ( Image: Getty Images) Fabio One of the Brazilian full-back pair alongside twin brother Rafael, they arrived at Old Trafford in 2008 from Fluminense. Whilst Rafael went on to play on 170 occasions for the Red Devils, his brother was only afforded 56 outings. After leaving in 2013, he had stints with Cardiff and Middlesbrough before he ventured abroad to sign for Nantes in 2018. He returned to his homeland with a move to Gremio earlier this year. Anderson From one Brazilian international to another, midfielder Anderson failed to live up to the hype that he had developed during a stint with Porto. The £20m signing did, however, manage to make 181 appearances for the Red Devils, scoring nine goals, and lifting an array of trophies. Like Fabio, Anderson returned to Brazil with a switch to Internacional in 2015 and was most recently with Turkish side Adana Demirspor. He retired from football back in September 2020. Man Utd target Victor Osimhen holds meeting with Napoli chief as transfer stance clear Mason Greenwood puts house up for let in huge hint over Man Utd future Tom Cleverley A Red Devils’ academy graduate, Tom Cleverley was sent on a succession of loan spells before finally earning his chance for the 2011/12 season. The 13-time England international eventually left for Everton in 2015 but stayed for just a season-and-a-half before rejoining one of his loan clubs Watford. Since then, he has gone on to make 146 appearances for the Hornets as they’ve bounced between the top two divisions. He was made captain ahead of the 2022/23 season and remains in talks over extending his stay at Vicarage Road. Nani Another of Ferguson’s crop currently on the lookout for a new club, Portuguese winger Nani was intended to be Cristiano Ronaldo's successor at Old Trafford. The skilful winger scored 40 goals in 230 outings before leaving on loan back to his former club Sporting Lisbon. He then embarked on a journeyman career that saw him take in spells with Fenerbahce, Valencia, Lazio, Orlando City, Venezia and Melbourne Victory. He only made ten appearances for the latter before suffering a serious knee injury and was then released at the end of the season. Nani scored 40 goals during his time at Man United ( Image: Getty Images) Wayne Rooney Man United’s record goalscorer, Rooney actually got the scoring underway at the Hawthorns before Shane Long’s equaliser - Steven Reid’s own-goal gifting three points to the Red Devils. Rooney’s achievements at Old Trafford need little mention. He brought an end to his hugely successful United career with an emotional return to Everton before moving to MLS side DC United. Derby County tempted him back to England and he went on to become Rams' boss. He was unable to keep them in the Championship amid financial turmoil and he eventually departed 12 months ago as he returned to DC. Danny Welbeck After progressing through the club’s youth system, Danny Welbeck scored 29 goals for United before a 2014 move to Arsenal. He saw his stint at the Emirates Stadium hugely disrupted by injury but still managed to lift two FA Cups as a Gunner. Welbeck had a one-season spell with Watford and then moved to Brighton following the Hornets’ relegation in 2020. He will be back in Europe next season after helping the Seagulls to a place in the Europa League.",
      "pubDate": "2023-06-25 06:00:00",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30313802.ece/ALTERNATES/s615/1_GettyImages-121136516.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "Aston Villa transfer news LIVE: Tyler Adams latest, Hirving Lozano claim, Kieran Tierney update",
      "link": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-live-transfer-news-27143044",
      "keywords": ["Sport"],
      "creator": ["newsdesk@birminghamlive.co.uk (Bruna Reis)"],
      "video_url": null,
      "description": "Aston Villa news from BirminghamLive as Villa will look to continue to do business in the transfer market",
      "content": "Welcome to our Aston Villa live blog on Sunday, June 25. New president of football operations, Monchi, is due to start work at Bodymoor Heath from July and arrives as one of the most experienced recruitment specialists in Europe. He will lead Villa's football department, while Chris Heck has already assumed the role of president of business operations since last month. Elsewhere, Johan Lange and Damian Vidagany have landed new roles to complete the restructuring. Lange has a key role as global director of football development and international academies, while Vidagany has taken up the position of director of football operations. Villa have already made their first summer signing, with Youri Tielemans set to join Emery's first-team squad in July, upon the expiration of his Leicester City contract. Villa will make several additions to Emery's team this summer as he looks to compete on all four fronts next term. Stay tuned and BirminghamLive will bring you all the news, as it breaks and you won't miss a thing. Key Events Aston Villa make 'lucrative offer' for Borussia Dortmund defender as transfer claim made 08:25 Leeds transfer may be on one condition 18:10 Newcastle could open the door for Villa 17:51 John McGinn recalls 'sink or swim' Aston Villa moment and reveals Champions League target 11:25 Aston Villa notebook: Chris Heck's plan, crest explained and Jacob Ramsey's England message 10:43 08:25 KEY EVENT Aston Villa make 'lucrative offer' for Borussia Dortmund defender as transfer claim made Aston Villa have made a lucrative offer to Borussia Dortmund for defender Thomas Meunier, it has been claimed. That's according to German newspaper Bild , who state the club's valuation on the player has tempted the Villans to make a move. With a year left on his current deal, Meunier is said to be valued at €3million (£2.5m). The Belgium international signed on a free transfer from Paris Saint-Germain back in 2020 but it is claimed he no longer plays a role under Edin Terzic. Borrusia are keen to sanction a transfer for the defender in order to cash some funds this window. Read more, here. Share Comments 19:54 Amie Wilson Villa complete double transfer Aston Villa have completed moves for Linfield youngsters Cole Brannigan and Callum Moreland, according to reports in Northern Ireland. The Belfast Telegraph report that the duo have put pen to paper on four-year deals at Villa Park and will go into the club’s academy. Both players are 16 with Villa said to see them as ‘potential first team stars’. Brannigan is an attacking midfielder who is also able to play on the wing, while Moreland plays in the centre of defence. Both represent Northern Ireland at youth level, with Villa said to have beaten off competition from the likes of Man City, Liverpool, Chelsea and Leeds for the youngsters. Read more here . Share Comments 18:10 KEY EVENT Leeds transfer may be on one condition Aston Villa are among the clubs who are showing an interest in Leeds United midfielder Tyler Adams, but it’s reportedly not a priority position for Unai Emery this summer. It was claimed earlier this week that Villa were ‘stepping up their interest’ in the USA international following Leeds’ relegation to the Championship at the end of last season. Nottingham Forest, Arsenal, Newcastle and Everton have all also been credited with an interest in the defensive midfielder. Villa manager Emery is expected to be backed by the club in the current transfer window as he aims to continue his progression with the team since joining last season. However, according to the Telegraph’s Mike McGrath, who was speaking on TalkSPORT , while Villa ‘like’ Adams, defensive midfield is not an area that is seen as a priority this summer. Read more here . Share Comments 17:51 KEY EVENT Newcastle could open the door for Villa Aston Villa could be handed a boost in their hopes of signing Arsenal full-back Kieran Tierney this summer, with Newcastle said to be moving on to other options. The Scotland international has been heavily linked with a move to St James’ Park in the current transfer window. Villa were, however, said to be providing competition to the Magpies with Tierney also emerging as a target for Unai Emery . The full-back saw his game time at the Emirates Stadium reduced last season thanks to the summer arrival of Oleksandr Zinchenko from Manchester City. He started just 14 times in the Premier League as Arsenal finished second. Read more here . Share Comments 14:22 Amie Wilson Villa sent Chelsea and Liverpool warning Aston Villa have been told that they will have to be prepared for what could be a ‘pivotal’ season for the club, with other sides continuing to strengthen in the summer transfer window. Villa turned their season around under Unai Emery in 2022/23, finishing in seventh place. It means that they will play in at least the play-off stages of the Europa Conference League in the upcoming season. European football is something that Villa will want as a regular occurrence in the coming campaigns, with the club making no secret of their Champions League ambition. Emery is expected to be backed in the summer window, with the club already confirming that an agreement has been reached with midfielder Youri Tielemans. Read more here . Share Comments Alex Dicken Villa 'show interest' in Lozano Aston Villa have shown interest in Napoli winger Hirving Lozano according to one agent. Lozano, 27, is the latest European-based player being linked with a big money transfer to Saudi Arabia. Lozano has reportedly received ‘multiple offers’ from Saudi clubs. The 64-cap Mexico international has spent the past four seasons in Naples and helped them win the Serie A title last term. Lozano scored three goals in Serie A, and scored once in nine Champions League outings. Read more HERE Hirving Lozano has been linked with Aston Villa (Image: Vincenzo Izzo/REX/Shutterstock) Share Comments Alex Dicken Reviewing this week's transfer stories The transfer window opened for Premier League clubs last week, and Aston Villa are busy making moves in the market. Unai Emery will be competing with the 'big six' to qualify for European football for the second season running next term, and added Youri Tielemans as his first signing earlier this month. Villa want to add several top quality additions to his squad this summer. Here, BirminghamLive reviews the top transfer lines surrounding Villa... Read John Townley's comment piece HERE Share Comments Alex Dicken Monchi sets the record straight Aston Villa's new football chief Monchi insists he didn't pay any clause to force Sevilla to release him from his contract. Monchi was named as Villa's new president of football operations last week in a behind-the-scenes restructure at Villa Park. The vastly experienced Monchi, 54, will lead Villa's football operations alongside head coach Unai Emery. He left Sevilla - the only club he represented as a player - under a cloud after claims that he had bought out his contract in order to join Villa. But Monchi insists that isn't the case and set the record straight at a press conference in Seville on Friday. Read what he said HERE Monchi waves to Sevilla fans (Image: Photo By Joaquin Corchero/Europa Press via Getty Images) Share Comments Alex Dicken Villa face a fight for Adams Tyler Adams is in-demand this summer. Villa are among the Premier League teams trying to sign the American midfielder from Leeds United following their relegation to the Championship. LeedsLive claim Villa are joined in the race for Adams' signature by Brighton, Everton and Nottingham Forest, whilst Newcastle United have been tentatively linked with the 24-year-old. Adams is likely to cost in excess of £25m. Leeds midfielder Tyler Adams has been linked with a move to Aston Villa (Image: Getty Images) Share Comments 14:34 Brian Dick Torres latest Villa have made one of two ‘firm offers’ for Villarreal defender Pau Torres. That’s according to Spanish outlet Sport who say Villa and Bayern Munich are now heading the queue for a 26-year-old centre back who has long been touted with a move away from the La Liga outfit. The report claims Juventus, who were front-runners, have now dropped out of the race for a player who won the Europa League under Uani Emery in 2021. Indeed it is said Emery regards Torres so highly he has ‘expressly requested’ Villa try to sign his former charge. Sport say Torres is in the final stretch of his time at Estadio de la Cerámica and that ‘everything indicates’ he will move to either Birmingham or the Bundesliga, with Bayern reportedly ready to sell Lucas Hernandez to PSG. MORE HERE Share Comments 14:22 Amie Wilson €60m claim Aston Villa have been handed a blow in their reported hopes of signing Juventus midfielder Federico Chiesa this summer, with the player not keen on joining the club. Chiesa has been linked with a move to the Premier League this summer after reportedly turning down a new contract with the Italian giants due to wage demands. Liverpool and Newcastle United are two clubs to have been linked with an interest. According to Sky Sports Italia , Villa are also interested in a summer move. The report claims that Unai Emery’ s side are ‘ready to offer over €60 million’ for the player in order to win the transfer race. Read more here . Share Comments 14:16 Isaac Seelochan Villa 'stepping up interest' in Leeds transfer Aston Villa are reportedly \"stepping up interest\" in Leeds United midfielder Tyler Adams, it is claimed. The USA international joined Leeds last summer from Bundesliga side RB Leipzig, making 26 appearances in all competitions during his debut campaign at Elland Road. But the defensive midfielder was not able to help them avoid relegation to the Championship last season, leading to speculation over his future at the Yorkshire club. Villa, Nottingham Forest, Arsenal, Newcastle and Everton have all been linked with a move for the defensive midfielder. FULL STORY HERE Leeds midfielder Tyler Adams has been linked with a move to Aston Villa (Image: Getty Images) Share Comments 12:05 Brian Dick Stayed put Dani Ceballos has signed a new deal with Real Madrid, ending speculation he will join Aston Villa this summer. The 26 year old former Arsenal midfielder was linked with a move to Villa Park with Unai Emery’s side even reported as favourites to sign him as it seemed he was frustrated by lack of game time at the Bernabeu. However Ceballos, who was also linked with Atletico Madrid and Real Betis, has signed a contract to keep him at Real until 2027. He has been with the club since 2017 when he joined from Betis. MORE HERE Share Comments 11:25 KEY EVENT John McGinn recalls 'sink or swim' Aston Villa moment and reveals Champions League target John McGinn salutes the Aston Villa fans after victory over Brighton secured European qualification (Image: Getty Images) John McGinn sees no reason why Aston Villa can't challenge for Champions League football next season after pledging his future to the club by signing a contract extension until 2027. The Villa captain has played a crucial role in the club's turnaround under Unai Emery , who transformed Villa's fortunes last season. At the time of Steven Gerrard's sacking in October, Villa were sitting above the relegation zone on goals scored, but after Emery's impact, the club will be playing European football for the first time since 2010 next campaign. McGinn is one of the first names on the Villa team sheet, and after impressing during their first months working together at Bodymoor Heath, Emery told his skipper that he wanted him to sign a new deal. McGinn joined the club just weeks after Nassef Sawiris and Wes Edens saved it from financial ruin, and has plenty more that he wants to achieve in claret and blue. READ MORE HERE Share Comments 10:43 KEY EVENT Aston Villa notebook: Chris Heck's plan, crest explained and Jacob Ramsey's England message Aston Villa released their eagerly anticipated home strip for the new 2023/24 campaign on Thursday, which features the 1982-inspired round badge. The moniker, which pays homage to the club's European Cup-winning heroes of 1982, will only be used across Villa's 2023/24 kits and training wear, while the current crest will remain in place around Villa Park and on their digital channels, as well as in other areas. Back in June, Villa had announced the start of a process to review their visual identity, including exploring a redesign of the current crest. Following an extensive period of fan consultation, season ticket holders and members were given two badges to pick as a new crest. READ MORE HERE Share Comments 10:09 Michael Baggaley John McGinn Supporters have been having their say after that contract news about John McGinn. There's no doubt who else they would like to see sign a new long term deal Read More Aston Villa captain John McGinn battles with Man United's Tyrell Malacia (Image: 2023 Getty Images) Share Comments 10:00 Michael Baggaley Great news about John McGinn Another £100m player on our hands, my captain pic.twitter.com/MorwFfLntM — Villa Watch (@VillaWatch1) June 23, 2023 Share Comments 09:49 Isaac Seelochan More on the McGinn contract The midfielder’s new deal will see him remain at Villa Park until 2027. He arrived at the Villans in the summer of 2018 from Hibernian having spent much of the early parts of his career in Scotland. McGinn was a regular fixture in the Villa team last season and played a key role in the club's transformation since the arrival of Spanish coach Unai Emery in October. The 28-year-old made 36 appearances in all competitions for Villa last season He was appointed club captain at the beginning of last season when Steven Gerrard was still in charge, having succeeded defender Tyrone Mings. READ MORE HERE John McGinn extends his Aston Villa contract (Image: Aston Villa) Share Comments 09:24 KEY EVENT Breaking: McGinn agrees new contract Aston Villa have announced that club captain John McGinn has signed a new long-term contract at the club. The midfielder’s new deal will see him remain at Villa Park until 2027. FULL STORY HERE Share Comments 09:07 Michael Baggaley How many? Not sure if you've had chance to catch up with John Townley's Villa Q&A this week but it's well worth a read. John reckons Villa are probably looking at bringing in five signings for the new season. So, plenty of action to come. A general view of Villa Park (Image: Photo by Matthew Ashton - AMA/Getty Images) Share Comments 08:48 Michael Baggaley Leeds player linked Aston Villa remain ‘keen’ to sign USA captain Tyler Adams but it would appear they will face plenty of competition if they press ahead with an offer for the Leeds United midfielder. Adams is expected to leave Elland Road this summer after they were relegated from the Premier League. Villa have been linked with him and, according to the Daily Mail , they remain keen but are just one of a handful of clubs interested in keeping Adams in the top flight. They say Brighton also want to sign him, as do Villa, Nottingham Forest and Everton. The 24 year old is rated at around £25m having cost Leeds in the region of £20million from RB Leipzig last summer. Unai Emery is looking to bolster his options for next season following Villa's return to Europe and Adams is said to be on the list of potential options. Read More Share Comments 07:46 Michael Baggaley Jacob Ramsey Aston Villa’s Jacob Ramsey didn’t just start and score in England’s 2-0 over the Czech Republic on Thursday, he was also named the official UEFA man of the match for his efforts for his country. That’s the latest accolade for the 22 year old midfielder who scored six goals with a further eight assists in 38 games for his club last season to help them finish seventh and secure a Europa Conference League spot. He started for England in their 2-0 win over the Czech Republic in their opening match of the 16 nation Euro 2023 finals – and made his mark when he opened the scoring in the 47th minute. Arsenal's Emile Smith Rowe then doubled the lead in stoppage time, thanks to an assist from Villa's Cameron Archer. Read More Share Comments 07:00 Michael Baggaley Jacob Ramsey Congratulations to Villa's Jacob Ramsey who was man of the match for England under-21s in their win over the Czech Republic in Euro 2023 yesterday. Jacob Ramsey of England (Image: Photo by Alex Caparros - UEFA/UEFA via Getty Images) Share Comments 06:59 Michael Baggaley Villa news Let's kick off with your Friday morning headlines featuring a new front of shirt sponsor, news from the Villa Supporters Trust, the latest on the potential sale of Marvelous Nakamba and the future of Keinan Davis. Read the full story Share Comments 06:56 Michael Baggaley Good morning everyone Hello all and thanks for joining us on your Aston Villa live blog for Friday June 23. The new season is less than two months away and there is much to discuss with maybe five new signings likely as Villa prepare for the 2023/24 campaign. We'll be keeping track of the latest transfer news, bringing you the latest on Jacob Ramsey after he shone for England under-21s and also following issues on and off the pitch. Share Comments 20:24 KEY EVENT Aston Villa Supporters' Trust respond to major BK8 announcement Aston Villa Supporters' Trust have responded to the club's new partnership with BK8. Villa announced a multi-year partnership with the online sportsbook and casino company earlier today. BK8 will be the new principal and front of shirt partner ahead of the new 2023/24 season. Read more, here. Share Comments 19:34 Bruna Reis Gareth Southgate receives Aston Villa response after Jacob Ramsey's 'class' England display Aston Villa star Jacob Ramsey was on the scoresheet in England under-21s' Euro opener against Czech Republic. The Young Three Lions defeated Czech Republic 2-0 at the Adjarabet Arena in Georgia. Ramsey, who was named in Lee Carsley's starting line-up, struck in the 47th minute. Arsenal's Emile Smith Rowe then doubled the lead in stoppage time, thanks to Cameron Archer's assist. Read more, here. Share Comments 16:55 KEY EVENT Aston Villa transfer '99.9 percent' done as Unai Emery grants player wish Aston Villa midfielder Marvelous Nakamba is reportedly closing in on a permanent transfer move to Luton Town. That's according to Zimbabwe outlet H-Metro who claim a reliable source in Nakamba's camp has confirmed the news. The Zimbabwe favourite joined the Hatters on loan in January and played a significant role in their promotion campaign to the Premier League. Rob Edwards' side defeated Coventry City 6-5 on penalties in the play-off final at Wembley and Luton have been keen to sign the midfielder on a permanent basis. Recent reports claimed that Villa had no plans to reintegrate Nakamba into the squad this summer. Read more, here. Share Comments 15:57 KEY EVENT Aston Villa tipped to sanction transfer for forgotten forward as £4m claim made Keinan Davis is reportedly open to leaving Aston Villa this summer. The 25-year-old spent last season on loan at Watford. He started in 27 games, recording seven goals and two assists. A permanent move to Vicarage Road didn't materialise as the Hornets failed to secure promotion to the Premier League. The sides had an agreement in place for Watford to sign Davis for a £15million fee if promotion was achieved. Read more, here. Share Comments 10:40 John Townley Aston Villa 23/24 kit confusion explained after Gary Lineker question Aston Villa have confirmed a multi-year partnership with BK8, but there has been some confusion about the new partnership after the Premier League confirmed that gambling sponsorships would soon be banned. Villa's partnership with the online sportsbook and casino company will end in 2025/26, the season before the Premier League's new rule will come into effect. Clubs in the English top-flight agreed to collectively withdraw gambling sponsorships from the front of matchday shirts earlier this year. It follows an extensive consultation involving the league, its clubs and the Department for Culture, Media and Sport as part of the Government’s ongoing review of current gambling legislation. READ MORE HERE Share Comments",
      "pubDate": "2023-06-25 06:00:00",
      "image_url": "https://i2-prod.birminghammail.co.uk/incoming/article26503415.ece/ALTERNATES/s615/0_GettyImages-1472922594.jpg",
      "source_id": "birminghammail",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "411’s AEW x NJPW Forbidden Door Preview",
      "link": "https://411mania.com/wrestling/411s-aew-x-njpw-forbidden-door-preview/",
      "keywords": ["AEW x NJPW Forbidden Door II"],
      "creator": ["Ryan Ciocco"],
      "video_url": null,
      "description": "Ryan Ciocco checks in with 411's AEW x NJPW Forbidden Door 2023 preview. The post 411’s AEW x NJPW Forbidden Door Preview appeared first on 411MANIA.",
      "content": "Greetings and salutations everyone, and welcome to this preview of Forbidden Door II, the event SO nice that they decided to hold it twice! As we look towards the show its self, I’d like to take a minute to reflect on the first rendition of this show which, despite having a good amount of injuries on both sides of the aisle from AEW and New Japan, still produced some quality matches. For starters, we got the proper, in-ring debut of Claudio Castagnoli, as he was introduced as Bryan Danielson’s replacement in a match with Zach Sabre Jr. We also had two very strong 4-way matches to decide both the then All-Atlantic title, as well as the IWGP World Heavyweight Title, and who could forget the main event between Jon Moxley and Hiroshi Tanahashi, with the former defeating the latter in defense of his AEW Interim Title belt? And that’s not to discredit the awesome three team IWGP and ROH tag team title unification match that saw FTR come out on top with THREE sets of title belts. This year, better health has permitted for both New Japan Pro Wrestling and All Elite Wrestling to field a very strong card yet again, as the fans of both companies (and wrestling in general, per se) will populate the Scotia Bank Arena in Toronto for a night they won’t soon forget. Let’s get to it, shall we? Women’s Owen Hart Cup Tournament Match (The Buy-In) Athena vs. Billie Starkz Image Credit: AEW Happy graduation present, Billie, you’re about to get your rear kicked by the dominant Ring of Honor Women’s Champion! (Come to think of it, I’m pretty sure she already has in one of Athena’s ROH Women’s Title Proving Ground matches, but…) At any rate, I am certainly happy for both ladies, as they get a spot on the card (even if it is on the Buy-In/Zero Hour pre-show available readily and for free on YouTube) and they were two of the eight women who were drawn to compete in the second annual Owen Hart Cup. Clearly, I do not think that anyone will be surprised by the outcome of this match and who goes over, but I will say that it’s great for young Billie to get more mainstream exposure within the industry, and I just hope that she at least gets SOME offense in on Athena before she goes HAM on Starkz. WINNER: Athena Adam Cole (BAY BAY!) vs. “Filthy” Tom Lawlor Image Credit: AEW A relatively late addition to the card seeing as it was added on this week’s edition of Rampage, this match is clearly a power play between “random tag team partners” in MJF and Cole. You will recall that on this past week’s edition of Dynamite, that Cole persuaded/got into the head of MJF and basically strong armed him into accepting the title defense challenge against Tanahashi for the PPV. So to get back at Cole, MJF set up a “tune up match” with Lawlor, as both him and Royce Issacs beat up on Cole in the middle of the ring until MJF “made the save” on Cole’s behalf. Of course, that will do nothing to speak to the quality of the match we have at hand, as we all know that Cole can go with seemingly anyone anytime and anywhere, and those who have followed the career of Lawlor know that he has taken to wrestling post his MMA career like a duck to water. While the purpose of the match was to serve as the AEW World Champion’s game of one-upping Cole, the completely random feel of the opponents could very well make for a sneaky good (or at least very solid) match between them with a winner that should be obvious. WINNER: Adam Cole Chris Jericho, Sammy Guevara, and Minoru Suzuki vs. Sting, Darby Allin, and TBA Image Credit: AEW This is not the first time that “Le Suzuki Sex Gods” have come together as a team, as you will recall at the inaugural Forbidden Door event they defeated the team of Eddie Kingston, Wheeler Yuta, and Shota Umino. This is, however, the first time that Jericho and the Icon Sting will be in a match against each other in the history of their careers, which says a lot considering both men were in WCW and WWE at the same time. However, all of these angles and story lines omits the biggest question mark surrounding this match, which is the mystery tag team partner that the guys in face paint will bring with them. At last year’s event, it was Sting and Darby teaming up with Shingo Tagaki (and was supposed to be Hiromu Takahashi as well, however, he was not cleared to travel for the event) to defeat The Young Bucks and El Phantasmo (with Hikuleo benched due to the removal of Hiromu). But, as Sting and Darby both mentioned, this man they are bringing has a history with Jericho, and while none of the guys involved with Darby and Sting last year fit the bill, it does leave plenty of options open for whomever that may be. To be honest, I don’t feel like the third person matters, as this is a situation where Sting and Darby will go over anyway, with the mysterious third person being a ride along for the victory. WINNER: WINNERS: Sting, Darby Allin, and the mystery third component Moxley, Wheeler Yuta, Claudio Castagnoli, Konosuke Takeshita & Shota Umino vs. The Elite, Eddie Kingston, and Tomohiro Ishii Image Credit: AEW For some reason, I can’t help but feel like the “Anarchy in the Arena” match back at Double or Nothing was made to be a bigger deal between the Blackpool Combat Club and The Elite (complete with Hangman Page reunion). That Kenny Omega will not be standing in with his Elite brothers and instead we have two completely random partners for Nick, Matt, and Adam makes this feel lessor on par with that match and more of a match just to have a match. However, let’s not dismiss this match as a completely random and hapless mishmash of talent. For starters, Moxley and SHOOTER together is always a fun time, as everyone knows how close the guys have been in New Japan and its American based off-shoot, New Japan STRONG. You also have the concept of Takeshita fighting alongside the BCC and Umino (after much posturing was originally made by Don Callis that they were NOT affiliated with the BCC), and this group definitely makes a lot more sense than their opponents. While it will be awesome to see Mad King and The Stone Pit Bull teaming up with The Elite, the reasoning for such a union feels way less organic and unstable than their opponents (Eddie doesn’t respect The Elite but he hates Claudio, and Ishii is there because Eddie chose him). While I COULD see The Elite and Eddie/Ishii working together long enough to win this match, I feel like their opposition are a more natural unit that will gel far easier. WINNER: The BCC, Konosuke Takeshita, and Shota Umino Men’s Owen Hart Cup Tournament Match CM Punk vs. Satoshi Kojima Image Credit: AEW Let’s not waste our time and believe that Kojima is actually going to win this match, because he isn’t, barring an audible that is called because “Pepsi Phil” gets injured and they can’t have him move on in the Men’s Owen Hart Cup. Let’s instead talk about how great of a match these two guys can have and how good they are at their craft in professional wrestling. It may be disappointing to some that this match isn’t the “Battle of the GTS” between Punk and KENTA, but Kojima is a 32-year veteran of the wrestling game, mainly between New Japan and All Japan Pro Wrestling. Most infamous for the “machine gun chops”, Kojima is a world champion in both promotions and will pose a viable threat to Punk in his first singles match since his return to AEW. Speaking of, Punk’s stamina will be tested here as, like mentioned above, he has yet to appear in a singles match since he returned to the company, but let’s be honest, its not like he would just lose the ability to thrive as a singles guy anyway. And, despite the most obvious end result that we SHOULD get to, let’s take a moment to appreciate just how good they two guys can give for this bout. WINNER: CM Punk AEW Women’s World Championship Match Toni Storm vs. Willow Nightingale Image Credit: AEW Another match where the end result should be predictable (except this time, it will be because of the woman who is defending her belt and who isn’t), this is the first and only match on the card to feature AEW exclusive talents in it. That there has been a preexisting story line already in place (even if it comes and goes) only makes this match between two powerful ladies all the more interesting. But again, the onus of this match is placed squarely on one Toni Storm, since it will be her AEW Women’s Title on the line and NOT Willow’s recently won Women’s STRONG Title (although the thought of a title unification here could have been interesting). And while it would have been pretty obvious who was going to win anyway based off of the title on the line, let’s not fool ourselves and assume that Storm won’t be going into this match without the rest of the Outcasts at her side while Willow will come out, presumably, by herself, unless Skye Blue isn’t busy. However, even in that case, I cannot see Storm losing the belt she very recently won from Jamie Hayter at Double or Nothing, and perhaps a win here will push her towards challenging for Willow’s Title next. WINNER: Toni Storm (And STILL Champion!) AEW International Championship Match Orange Cassidy vs. Zack Sabre Jr. vs. Katsuyori Shibata vs. Daniel Garcia Image Credit: AEW Finally, we arrive at a match where it truly does feel like the result could be completely up in the air, and perhaps the mighty reign of Orange Cassidy finally comes to an end as someone gets the better of him (or, by extension, someone else who is in the match and therefore Orange doesn’t have to be pinned or submitted to lose his title). Assuming there is no title change and everything remains status quo, the talent in this match alone makes this a viable candidate for match of the night status. What’s even more interesting about this match is that, while some guys have personal interchanges (Cassidy-Garcia and ZSJ-Shibata), no one in this match had a very memorable night at the first Forbidden Door. While neither Garcia nor Shibata were on that show, Orange lost his IWGP United States Title match to champion Will Ospreay, and Sabre lost to the debuting Castagnoli in place of Danielson. By default, either someone is going to redeem themselves in this match, or someone will win their Forbidden Door debut match, and to be completely honest yet again, the way titles have went around the globe, you can make the argument for anyone to win this match. However, I feel like both Shibata and Sabre already having their belts rules them out, and while Garcia would make sense, he’s already made a stake to claim the Pure Title from Shibata. So when we take all of that in… WINNER: Orange Cassidy (And STILL Champion!) IWGP World Heavyweight Championship Match SANADA vs. Jungle Boy Jack Perry Image Credit: AEW Look, I understand that the build for a card like this will never be as strong as any inner-promotional card could ever be, however, I was hoping that the build for a match involving the richest prize in New Japan would be more than just merely random banter about how the champion “doesn’t know Jack Perry” and Perry finally coming face to face with SANADA on the go home edition of Rampage. And never mind the people who will complain that they were “hoping that someone better than Jungle Boy” would challenge for the IWGP World Title belt. But, let’s not sell the ability for this match to be good short, because it can definitely be. While Perry may not be the marquee challenger for the IWGP Title (and so soon after he lost in the 4-way match for the AEW World Title less than a month ago at Double or Nothing), there is no denying that he is one of the best and brightest talents in AEW. SANADA, on the other hand, has always been a good hand no matter what group he was in, or title belt he was around, but he finally realized his potential when he won the IWGP World Title recently from Kazuchika Okada. As with many of the matches on this card, the end result should not shock or surprise anyone, but the quality of the match going in and what these guys can deliver should definitely be on the higher end of realized potential. WINNER: SANADA (And STILL Champion!) IWGP United States Championship Match Kenny Omega vs. Will Ospreay Image Credit: AEW It is very interesting how much of a difference a year can make in the wrestling business; at this same event a year ago, Omega was forced to sit it out due to the laundry list of injuries he had and the surgeries he required, while Ospreay was the defender of this same title belt against Orange Cassidy. At the second installment of Forbidden Door, not only have roles changed, but this will renew a rivalry that has been dying for an adamant conclusion for some time now. I must confess to my mistakes previously, whereas I was assuming that a New Japan based talent, when opposing Omega for the United States Title, would win it so they could take the title back to Japan (Omega’s match on Dynamite with Jeff Cobb some time back, for one). However, Ospreay winning the title belt that he previously had and also lost to Omega would serve as the ultimate irony and the revenge that Will would seek against Kenny. If for nothing else, this match is going to be a lot of fun given how much these guys have previously not liked each other and how much relatively healthier they are than in their previous encounters. I just hope that the match doesn’t feature any outside shenanigans (for instance, Callis coming out to screw over Omega) and it is just a hotly contested match between two super talented wrestlers. WINNER: Will Ospreay (And NEW Champion!) AEW World Championship Match MJF vs. Hiroshi Tanahashi Image Credit: AEW So, for the above match, I made reference to how much can change in the business in one year. However, the opposite may end up being true in this match, as everyone may recall that last year in the show’s main event, Tanahashi lost an AEW Interim Title match to Moxley. One year later, The Ace of New Japan finds himself fighting for the biggest prize in AEW once again, except this time against the man who dethroned Moxley for the title back in November at Full Gear in one Maxwell Jacob Friedman. So, will history repeat its self, or will Tanahashi Hi-Fly Flow his way to victory and become the new World Champion of AEW? Well, if I’m being completely honest, the prospect of someone else being the champion in AEW sounds very intriguing, a man as accomplished as Hiroshi, no less. However, let’s dispel of the notion in one fell swoop by simply acknowledging the fact that the title reign of MJF has a long way to go yet. And while he wasn’t going to drop the title in the “Four Pillars” match at Double or Nothing, he more than likely is not going to drop the belt to a talent outside the company either. Although, can you imagine the roof coming off for every near fall pin attempt that Tanahashi gets on MJF? WINNER: Maxwell Jacob Friedman…MJF (And STILL Champion!) Bryan Danielson vs. Kazuchika Okada Image Credit: AEW You know, it really does say a lot about the two men in this match when it was announced as the main event of the show and they don’t even NEED a title belt on the line to make it all the more important. (Either that, or it lines up with my ideology that hardly any of the title belts are in grave danger of trading hands, take your pick. I personally would give the nod to the impact of these two generational talents facing off with no title belt.) While these men are both very talented in the ring and can go with just about anyone out there, let’s not sell this short of being a legitimate dream match (as much as I may cringe at the usage of such terminology). And while Danielson couldn’t go last year (as mentioned earlier, Claudio was drafted in to take his place) one wonders IF he had been cleared, would the matches have been changed around so these two guys could have met (Okada took part in the 4-way IWGP World Title match, which was won by Switchblade Jay White)? For all intent and purposes, I feel like I know who SHOULD win this match up, but I will not be too upset if this one goes a half hour with 500 near falls and a couple of awesome submission hold reversals thrown in for good measure. WINNER: Bryan Danielson And that will do it for the preview! All that is left is to check out Forbidden Door II Sunday Night at 8PM EST, and don’t forget to check out the Zero Hour on the company’s YouTube channel starting at 7PM EST, where you can catch up on the build for all of the show’s main matches, and also catch the Owen Hart Women’s Cup match between Athena and Billie!",
      "pubDate": "2023-06-25 04:05:00",
      "image_url": null,
      "source_id": "411mania",
      "category": ["sports"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Arsenal transfer round-up: Declan Rice deal questioned as Serie A switch touted",
      "link": "https://www.mirror.co.uk/sport/football/news/arsenal-transfer-rice-timber-partey-30314671",
      "keywords": ["Football"],
      "creator": ["mirrornews@mirror.co.uk (Josh O'Brien)"],
      "video_url": null,
      "description": "Arsenal are still being linked with top-tier talent as the race for Declan Rice continues, with Ajax ace Jurrien Timber also the subject of intense interest from the Gunners",
      "content": "Arsenal's transfer window is shaping up to be one for the ages if Mikel Arteta can land his first-choice targets. All of Declan Rice, Kai Havertz and Jurrien Timber have been touted with moves to the Emirates, while talented teen Romeo Lavia is also one being monitored by the Gunners as he is expected to leave recently-relegated Southampton. It remains to be seen if Arsenal can pull off the seemingly impossible and sign all four of the aforementioned quarter. It is apparent that manager Arteta assessed his options, looked at the way his side capitulated at the tail-end of the title run-in last term and came to the conclusion Arsenal still needed serious strengthening. With that in mind, here are of some the main transfer talking points emerging out of the Emirates on Sunday, June 25. Arsenal ready second Timber bid Jurrien Timber looks set to leave Ajax for Arsenal ( Image: Getty Images) HAVE YOUR SAY! Who should Arsenal sign this summer? Comment below Not much has been made of Arsenal's pursuit of Timber given their efforts to sign Rice, but it is clear the Gunners are incredibly serious in their interest. Their first offer of £30million was swiftly rejected by Ajax, but Arsenal are now preparing their second bid for the 22-year-old, who has also been linked with moves to both Manchester United and Liverpool. According to the Daily Mail, the Premier League runners-up will table an improved £50m bid later this week. There is every chance that gets the deal done, given the recent reports suggesting Arsenal were £20m short with their first offer. Find the full story HERE. Rice chase questioned by Gunners legend Arsenal are thought to be leading the race for West Ham's Declan Rice ( Image: Getty Images) Arsenal icon Gilberto Silva has admitted he feels the figures being touted for Hammers captain Rice are too high and that Arteta should look to strengthen in other areas instead. \"Normally you see this sort of price for strikers, not central midfielders,\" Gilberto told Online Casinos. \"It feels quite high, even though there is no doubting the quality of the player, but it does feel like a very high price.\" The Brazilian went on to add how he feels the money could be better spent in defence, claiming: \"I’m thinking maybe another centre-back to keep them fresh for next season after they lost William Saliba. \"We have also seen Oleksandr Zinchenko rotate between left-back and central midfield, while Tierney has also struggled with injury problems. Find his comments in full HERE. Partey tipped for Emirates exit Thomas Partey has been linked with a move to Serie A ( Image: Getty Images) For all the talk of incomings, there could be one major outgoing at Arsenal in the form of Thomas Partey. The Ghana international has been linked with a number of possible destinations, including multiple Saudi Arabian outfits, but the most attractive proposal looks to have come from Italian giants Juventus, as per Calciomercato. The Serie A titans view Partey as a potential replacement for Adrien Rabiot, who is expected to call time on his Turin stay this summer.",
      "pubDate": "2023-06-25 03:00:00",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30165091.ece/ALTERNATES/s615/0_GettyImages-1492006695.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "Alexis Mac Allister explains why he rejected the number 8 shirt at Liverpool",
      "link": "https://www.mirror.co.uk/sport/football/news/alexis-mac-allister-explains-rejected-30312938",
      "keywords": ["Sport"],
      "creator": ["mirrornews@mirror.co.uk (Simon Mullock)"],
      "video_url": null,
      "description": "Alexis Mac Allister, 24, was given the option of walking in the footsteps of the Reds' former skipper Steven Gerrard when he completed his move from Brighton",
      "content": "Liverpool's £35million signing Alexis Mac Allister has revealed that he rejected the chance to wear the No 8 shirt out of respect for Anfield legend Steven Gerrard. Mac Allister, 24, was given the option of walking in the footsteps of the Reds’ former skipper when he completed his move from Brighton. Naby Keita failed to live up to expectations when he inherited Gerrard’s shirt following his £53 million arrival from RB Leipzig in 2018 and has not had his contract renewed. So Mac Allister opted for the No 10 shirt he wore at Brighton - and which is synonymous with Argentine superstars Lionel Messi and Diego Maradona. Federico Chiesa responds to Liverpool transfer links as Jurgen Klopp makes 'guarantees' Erik ten Hag transfer plan accelerates as deal given green light by Arsenal “One day, I was talking to my dad when he asked me what number I would wear for Liverpool,\" said Mac Allister. “I knew there were several numbers available - including 10 and 8. The No 8 shirt is a very important number in that club because of Gerrard, so I hesitated a bit. I ended up choosing the 10, but 8 is a number that I like a lot and has a history at the club.” The World Cup-winning midfielder will now wear the jersey of John Barnes, Sadio Mane and Michael Owen. Mac Allister was persuaded to move to Merseyside by a charm offensive led by manager Jurgen Klopp. The Kop boss pinpointed midfield reinforcements as being key to his Liverpool rebuild after a season which saw the Reds fail to make an impact in any competition before a late rally which saw them qualify for the Europa League. Mac Allister said: “After the season ended, I had the chance to talk to Klopp and he told me about the club, the city and what he wanted. The main thing was that from the first moment, they communicated with my family and with me, they wanted me to be there. Alexis Mac Allister joined Liverpool from Brighton ( Image: Liverpool FC via Getty Images) “When I was able to speak with the coach, it was made even clearer. It's the small details that made me choose Liverpool. I feel that it is the right step in my career.” Mac Allister added: “We all know that Klopp likes to play a lot on the counterattack, but in recent years there has been a change in his way of playing. He explained to me that he needed players to play between the lines and with a winning mentality. “I've always had that mentality - but even more so after the World Cup. I want to win titles - that's the goal that the club and I have. Liverpool is one of the biggest clubs in Europe and the world. Its history makes it like this. “The fans demonstrate in each match in the way they show up. But as well as history, there is a team with great players and a great coach. From the first moment, they showed me a lot of desire for me to be there.”",
      "pubDate": "2023-06-24 21:30:00",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30183543.ece/ALTERNATES/s615/0_Liverpool-FC-sign-Alexis-Mac-Allister.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    },
    {
      "title": "Jurrien Timber claims he has transfer agreement to join Arsenal after snubbing Man Utd",
      "link": "https://www.mirror.co.uk/sport/football/news/jurrien-timber-claims-transfer-agreement-30312908",
      "keywords": ["Sport"],
      "creator": ["mirrornews@mirror.co.uk (Simon Mullock)"],
      "video_url": null,
      "description": "The Dutchman turned his back on a move to Man United last year on the understanding that Ajax would allow him a dream move to the Premier League in this summer's window",
      "content": "Jurrien Timber believes he has a verbal agreement with Ajax that will allow him to join Arsenal. The Dutch defender turned his back on a move to Manchester United last summer on the understanding that the Amsterdam club would allow him a dream move to the Premier League this year. Ajax did not want Timber to leave after losing coach Erik ten Hag and Brazilian winger Antony to United after seeing a host of key players also depart. Holland’s boss Louis van Gaal also warned the 22-year–old that moving to Old Trafford would seriously damage his chances of going to the World Cup. Timber wants to be rewarded for his loyalty by being allowed to join Arsenal . Erik ten Hag transfer plan accelerates as deal given green light by Arsenal England coach pinpoints key trait which fuelled Jude Bellingham and Bukayo Saka success The Gunners are set to increase their initial £30 million offer this week after German giants Bayern Munich registered their interest with Ajax. The Dutch club value Timber at £52 million - but the player has set his heart on moving to the Emirates. He is flattered by Bayern’s overtures but has seen former Ajax team-mates Ryan Gravenberch, Daley Blind and Noussair Mazraoui all struggle to make an impact after joining the Bundesliga champions over the course of the last 12 months. If Bayern come up with a significantly bigger offer than Arsenal then Timber will have a tough decision to make. Despite Ajax’s promises, the Dutch club do not want to lose a player they believe can be at the heart of their own rebuild. They have failed to qualify for the Champions League after winning three Eredivisie titles. And, ironically, the man tasked with strengthening Ajax’s squad is former Arsenal head of recruitment Sven Mislintat. Jurrien Timber believes has has a verbal agreement with Ajax to join Arsenal ( Image: Getty Images) Mislintat is now the Amsterdam club’s technical director and has been playing hardball in negotiations. But Timber is excited by the prospect of helping turn Arsenal into champions and living in London. He decided to reject the chance to join United because Ten Hag was taking over at a club that appeared to be in crisis. But Mikel Arteta’s young team pushed Manchester City all the way in the Premier League title race. Timber feels he is a natural winner. Arsenal legend questions Declan Rice transfer pursuit as Man City enter race How Arsenal could line up with four new signings from £200m spree and two major exits He said: “We failed to win the title this year - and when that happens as an Ajax player, you have to feel ashamed. That is not a usual thing for Ajax and it is not usual for me. All through my career, right from the youth academy, I have been used to winning titles. “We have been brought up in an atmosphere of fighting for trophies and that is what I want. But everything that has happened in my career, including the year when I didn't win the league, has made me stronger and has made me more convinced that I am a leader. Definitely.”",
      "pubDate": "2023-06-24 21:30:00",
      "image_url": "https://i2-prod.mirror.co.uk/incoming/article30312951.ece/ALTERNATES/s615/0_FC-Twente-v-AFC-Ajax-Dutch-Eredivisie.jpg",
      "source_id": "mirroruk",
      "category": ["sports"],
      "country": ["united kingdom"],
      "language": "english"
    }
  ],
  "nextPage": "16876422004d544a5eb01bfd255cc4b4a7bf3d79df"
}
